class PrivacyPolicy {
  static String privacyPolicy = '''شروط الاستخدام
تاريخ السريان: يناير 2021

المقدمة
يرجى قراءة شروط الاستخدام (الشروط) إلى جانب سياسة الخصوصية وكافة السياسات الأخرى (يُشار إليهم بـ "الشروط والأحكام") بعناية تامة للتأكد من فهمك لجميع بنودها قبل استخدام موقع (https://majalaat.com) (يُشار إليه باسم "مجالات" أو "الموقع") حيث أنها تؤثر على حقوقك القانونية.

تتضمن هذه الشروط التعليمات والقواعد اللازمة لكيفية الاستخدام إجراءات الدخول والتصفح أو التسجيل والاستفادة من موقعنا (https://majalaat.com)، سواء بصفتك زائر أو مستخدم مسجل.

من خلال الوصول إلى أو استخدام أي جزء من الموقع أو الخدمات، فأنت توافق على الالتزام بهذه الشروط والأحكام، إذا كنت لا توافق على جميع بنود هذه الشروط والأحكام، فلا يجوز لك الوصول إلى الموقع أو استخدام أي من الخدمات.

نحن نحتفظ بحق تعديل أو تحديث أو تغيير هذه الشروط من وقت لآخر، ويجب عليك الطلاع عليها بشكل منتظم لمعرفة أي تغييرات تطرأ عليها، ويعتبر استمرارك في استخدام الموقع والخدمات بمثابة الموافقة التامة والصريحة على الالتزام بالشروط المُعدّلة والمطبّقة في وقت استخدامك للموقع.

معلومات عنا
مجالات هي منصة إلكترونية تتيح للمستخدمين إنشاء مجموعات لتلاوة وختم القرآن الكريم بشكل جماعي.

مجالات هي منصّة رقميّة تهدف إلى مساعدة كلّ مقبل على التعليم في مجتمعنا العربي على اختيار المجال والمكان الدراسي الأنسب لميوله وطموحه وقدراته وظروفه. تتيح النسخة الأولى من المنصّة إمكانيّة التشبيك والتواصل المباشر مع أشخاص خاضوا تجربة شبيهة لتلك التي يقف القبل على التعليم على عتبتها، أو يدرسون الآن موضوعا في مؤسّسة يفكّر بالالتحاق بها، أو أشخاص تخرّجوا وعملوا في مجال لسنوات عدّة ويمكنهم تقديم النّصح حول العمل في المجال وطبيعته.

التوقيع الرقمي
من خلال تسجيل حساب أو استخدام خدمات الموقع، أو عن طريق النقر على مربع قبول الشروط والأحكام إذا توفر ذلك، يعتبر أنك نفذت هذه الشروط والأحكام إلكترونياً، وتعد نافذة المفعول قانوناً في مواجهتك من تاريخ تسجيل الحساب أو استخدامك للموقع.

شروط استخدام الموقع والخدمات
يلزم لاستخدام موقع مجالات الموافقة على:

الامتثال لجميع القوانين والأنظمة واللوائح والقواعد المرعية والمطبقة في الدولة.

الالتزام بجميع الشروط والأحكام والتي تشمل شروط الاستخدام وسياسة الخصوصية وأي سياسات أو إرشادات يُقدمها موقع مجالات والتعديلات اللاحقة عليها.

استخدام الموقع للأغراض الشخصية فقط. وعدم عرقلة سير وتشغيل الموقع والخدمات.

أن موقع مجالات يتمتع بكافة الحقوق في الخدمات المقدمة من خلال الموقع وهي محمية بموجب حقوق الطبع والنشر وقوانين الملكية الفكرية الأخرى.

عدم تقديم أي جزء من الخدمة إلى أي أطراف أخرى أو السماح لهم بالوصول؛ أو التعديل على الخدمة أو تعطيلها أو التدخل فيها أو دعم الخوادم أو الشبكات بأي طريقةٍ كانت.

الوصول إلى الموقع والخدمات
الموقع متاح مجاناً للجميع وفقاً لشروط وسياسات الموقع، ونسعى دائماً لضمان إتاحة موقعنا الإلكتروني بشكل عادي على مدار اليوم. لذا أنت توافق على أن موقع مجالات لن يكون ملتزماً إذا لم يكن الموقع متاحاً لأي سبب في أي وقت أو لأي مدة.

يتحمل المستخدم مسؤولية الحصول على جميع الأجهزة الخاصة والبرمجيات والمعدات الأخرى اللازمة للوصول إلى واستخدام موقع مجالات وجميع النفقات المتعلقة بذلك، بما في ذلك رسوم الاتصال بالإنترنت، حيث تتطلب وظائف معينة من الموقع أن يكون لديك اتصال نشط بالإنترنت سواء كان الاتصال عن طريق Wi-Fi، أو من قبل مزود شبكة الهاتف المحمول، ولكن لا نتحمل المسؤولية عن عدم عمل الموقع بكامل وظائفه إذا لم يكن لديك اتصال بالإنترنت.

أنت توافق على الامتثال لأي وجميع الإرشادات والإشعارات وقواعد وسياسات التشغيل والتعليمات المتعلقة باستخدام الخدمات و/أو الوصول إلى الموقع، ونحتفظ بالحق في مراجعتها في أي وقت، وتعتبر على علم بأي تغييرات على ما سبق عند نشرها على الموقع.

يتحمل المستخدم مسؤولية التأكد بأن جميع الأشخاص الذين يدخلون إلى موقعنا من خلال الاتصال عن طريق شبكة الإنترنت لديه، يجب أن يكونوا على علم تام بالشروط والأحكام المتبعة والامتثال لها.

الحساب
للاستفادة من الخدمات المتاحة أو للوصول إلى أقسام وميزات معينة بالموقع قد يُطلب منك إنشاء حساب، أنت توافق كمستخدم على:

الامتثال لجميع القوانين والأنظمة المرعية والمعمول بها عند استخدام الخدمات.

تزويد موقع مجالات بالبيانات المطلوبة في حقول إنشاء الحساب، ويجب أن تكون هذه البيانات كاملة وصحيحة ودقيقة، والالتزام بتحديثها كلما طرأ عليها أي تغيرات، وتحمل المسؤولية عن أي أخطاء فيها.

الإقرار بأن الحساب شخصي، والتعهد بتحمل كافة المسؤوليات والتصرفات الصادرة من خلال الحساب.

الموافقة على عدم استخدام الحساب لأغراض غير قانونية أو احتيالية أو غير لائقة أو مسيئة للغير.

الالتزام بالحفاظ على أمان الحساب وسرية المعلومات المتعلقة به وبالأخص كلمة المرور واسم المستخدم، وتقييد الغير من الوصول إلى الحساب.

التعهد والالتزام بإخطار إدارة الموقع بأي استخدام غير مصرح به أو في حال تعرض الحساب للاختراق.

لإدارة مجالات الحق في تقييد وصول أي مستخدم سواء بشكل مؤقت أو دائم، أو إنهاء أي حسابات في الحالات التالية:

إذا ثبت أنك قدمت معلومات غير صحيحة أو غير دقيقة أو غير حديثة أو غير كاملة.

إذا ثبت أنك تخالف أو تنتهك الشروط والأحكام والسياسات والقواعد والارشادات المتبعة بالموقع.

إذا تسببت تصرفاتك في أي أضرار أو خسائر أو مسؤولية تجاهنا أو تجاه أي مستخدم لدينا.

في أي ظروف أخرى، وفقاً لما تراه إدارة مجالات مناسباً.

قواعد السلوك
يجوز لك استخدام خدماتنا بالشكل المسموح به قانوناً فقط ووفقاً لبنود هذه الشروط والأحكام، وتخضع الحقوق الممنوحة لك في هذه الشروط للقيود التالية:

لا يجوز لك ترخيص أو بيع أو تأجير أو نقل أو تخصيص أو توزيع أو استضافة أو استغلال الخدمة.

لا يجوز لك الوصول إلى الخدمة أو الموقع من أجل إنشاء خدمات أو مواقع مماثلة أو منافسة.

لا يجوز لك تعديل أو ترجمة أو تكييف أو دمج أو تفكيك أو إجراء أعمال مشتقة لأي جزء من الموقع، بما في ذلك على سبيل المثال لا الحصر النصوص، الصور، الأكواد، تصميم واجهة المستخدم أو الشعارات وغيرها، باستثناء ما إذا كانت القيود السالفة الذكر محظورة صراحة بموجب القوانين المعمول بها.

لا يجوز لك إزالة أو إتلاف أي حقوق للملكية الفكرية أو العلامات التجارية الخاصة بنا أو بالآخرين.

لا يجوز لك نشر أي مواد تحتوي على فيروسات أو أي برامج أخرى ضارة مثل (Trojans، Worms، Logic Bombs، Time Bombs، Keystroke Loggers، Spyware، Adware) أو أية شفرات خبيثة أو ملفات أو برامج حاسوبية أخرى مصممة للإضرار بالتشغيل العادي للخدمة (سواء بشكل كامل أو أي جزء منها) أو التدخل فيها أو تحديدها، أو لأي برمجيات أو أجهزة حاسوبية أخرى.

لا يجوز لك نشر أو إرسال أو نقل أي محتوى أو مواد تتسم بالتمييز العنصري، أو التمييز في الدين أو العرق أو السن أو الأصل القومي أو الإعاقة، أو بقصد الاحتيال أو المضايقة أو الإهانة أو الإرهاب أو التشهير بأي شخص أو يُخل بالآداب العامة.

لا يجوز لك نشر الرسائل الإلكترونية الغير مرغوب فيها (سبام) أو الرسائل التي تدعم أي أنشطة غير قانونية.

لا يجوز لك انتحال صفة مجالات أو شخصية أحد موظفيها أو أي مستخدم آخر أو أي كيان، أو تقديم معلومات كاذبة عن انتمائك لأي شخص.

لا يجوز لك تتبع أو جمع أي معلومات شخصية للمستخدمين الآخرين.

لا يجوز لك نقل حسابك إلى أي شخص آخر، ولا يجوز لك استخدام حساب أي شخص آخر في أي وقت دون إذن صاحب الحساب.

لا يجوز لك الوصول غير القانوني إلى الموقع أو أي شبكات أو خوادم أو أنظمة كمبيوتر متصلة بالموقع.

لا يجوز لك التعدي على حقوق الملكية الفكرية أو العلامات التجارية لموقع مجالات.

تراخيص الاستخدام
يمنحك موقع مجالات ترخيصاً محدوداً وغير قابل للتحويل وغير قابل للترخيص من أجل الوصول إلى أو استخدام الموقع أو تلقي المحتوى المتاح من خلال الخدمة لاستخدامك الشخصي فقط غير التجاري.

يجوز لك استخدام خدماتنا بالشكل المسموح به قانوناً فقط، ووفقاً لشروط وأحكام موقع مجالات، وفي حال عدم التزامك بالشروط والسياسات المتبعة لدينا تنتهي التراخيص الممنوحة لك من قِبلنا.

يحظر عليك التنازل إلى الغير عن التراخيص الممنوحة لك من قبل موقع مجالات دون الحصول على موافقة مسبقة.

يحظر عليك عمل أي نسخة مطابقة لموقعنا أو أي من الخدمات التي تقدم من خلاله أو استخدامها لأغراض الاستغلال التجاري أو غير التجاري.

كافة الحقوق غير الممنوحة لك صراحة في هذه الشروط أو أي سياسات أخرى يحتفظ بها موقع مجالات، كما يحتفظ بحقوق استغلالها وحقوق منحها في أي وقت.

المحتوى
يتضمن موقع مجالات مجموعة من المحتوى الذي نرخّصه من أطراف ثالثة أو الذي يتم إنشاؤه ونشره من قبل مستخدمينا. قد تخضع المواد التي يتم تحميلها على موقع مجالات لقيود منشورة على الاستخدام أو النسخ و /أو النشر. أنت مسؤول عن الالتزام بهذه القيود إذا قمت بتنزيل هذه المواد.

بصفتك مستخدماً لموقع مجالات، لا يجوز لك تعديل أو نشر أو نقل أو المشاركة في نقل أو بيع أو إعادة إنتاج أو إنشاء أعمال مشتقة أو توزيع أو تنفيذ أو عرض أو استغلال أي من المحتوى الموجود على موقع مجالات – بأي شكل من الأشكال سواء كلياً أو جزئياً – خارج حقوق الاستخدام المحددة والممنوحة لك بواسطة كل ترخيص.

قد يتضمن المحتوى أو المعلومات الواردة في هذا الموقع من حين لآخر على أخطاء مطبعية أو عدم دقة أو سهو فيما يتعلق بالخدمات والمحتوى الخاص وغيرها من الأمور، لذلك يحتفظ موقع مجالات بحق تصحيح أي محتوى به أي أخطاء أو عدم دقة أو سهو، أو تغيير أو تحديث المعلومات في أي وقت دون إشعار مسبق.

مساهمات ومحتوى المستخدم؛ ومراقبته
قد يحتوي الموقع على ميزات تفاعلية تتيح للمستخدمين نشر أو تقديم أو إرسال أو عرض أو توفير محتوى ومعلومات نصية أو صوتية أو مرئية إلى الموقع أو مستخدمين آخرين (مجتمعة "مساهمات المستخدم")، يجب أن تمتثل جميع مساهمات المستخدم لمعايير المحتوى المحددة في شروط الاستخدام هذه.

أنت تقر وتتعهد بما يلي:

ملكية أو التحكم في جميع هذه المساهمات ولديك الحق في منح الترخيص الممنوح أعلاه لنا ولشركائنا ومقدمي الخدمات التابعين لنا ولكل من المرخص لهم ولمن خلفهم ومن يعينهم.

مسؤوليتك عن أي مساهمات تقدمها أو تساهم بها، وأن موقع مجالات لا يتحمل المسؤولية عن هذا المحتوى، بما في ذلك مشروعيته وموثوقيته ودقته وملائمته.

أن موقع مجالات ليس مسؤولاً تجاه أي طرف ثالث عن محتوى أو دقّة أي مساهمات تنشرها أو أي مستخدم آخر.

نحن نتبع سياسات وإرشادات محددة فيما يتعلق بنشر وإرسال أي محتوى من خلال موقعنا، لذا أنت توافق على أنك لن ترسل أو تحاول إرسال أي محتوى غير مصرح به والذي قد ينتهك أياً من الشروط والأحكام، بما في ذلك، على سبيل المثال لا الحصر:

انتهاك حقوق الطبع والنشر لطرف آخر أو حقوق الملكية الفكرية الأخرى.

التسبب في ضرر أو أذى أو مضايقة لأي شخص أو قد يمنع أو يقيد أو يعيق الآخرين من استخدام الموقع.

الوصول غير المصرح به إلى معلومات المستخدمين الآخرين.

التعديل أو الإضرار أو التعطيل أو التغيير أو التداخل مع استخدام أي ميزات أو وظائف أو تشغيل أو صيانة ميزات تقديم محتوى المستخدم.

أي متطلبات أو قواعد أو شروط أو أحكام قد تنطبق على ميزات تقديم محتوى المستخدم.

يحتفظ موقع مجالات بالحق في مراقبة أي نشاط أو محتوى أو مواد يقدمه المستخدم على الموقع أو من خلال الخدمات أو فحصه أو التحكم فيه بأي شكل آخر للتأكد من أنه يتوافق مع معايير المحتوى لدينا، ويجوز لنا، وفقاً لتقديرنا المطلق، التحقيق في أي انتهاك لهذه الشروط والأحكام واتخاذ أي الإجراء المناسب.

يحتفظ موقع مجالات وفقاً لتقديره الخاص بحق إزالة أي محتوى يرى أنه ينتهك الشروط والأحكام.

إخلاء المسؤولية
ما لم يتم التعبير عنه صراحةً وإلى أقصى حد يسمح به القانون، فإن موقع مجالات لا يقدم أي ضمانات أو تعهدات من أي نوع سواء كانت صريحة أو ضمنية فيما يتعلق بالموقع أو الخدمات، ومحتوى الموقع ومحتوى المواد وأي محتوى مقدم أو أي مواد أخرى متوفرة على الموقع أو من خلاله على أساس ثابت "كما هي" أو "كما هو متاح".

نحن نبذل قصارى جهدنا لضمان توافر الخدمة للاستخدام، ولكن لا نتحمل أي مسؤولية عند حدوث أي انقطاع محتمل في الخدمة بسبب -على سبيل المثال لا الحصر-أعمال الصيانة أو المشكلات الفنية أو أي مسائل خارجة عن إرادتنا أو سيطرتنا بما في ذلك على سبيل المثال لا الحصر أي فشل في الأداء أو خطأ أو سهو أو انقطاع أو تعطل أو تأخر في التشغيل أو عدم صحة أو عدم اكتمال بيانات ومعلومات الإدخال المقدمة على مواقع الأطراف الأخرى التي قد تكون مرتبطة بخدماتنا، بشكل مباشر أو غير مباشر.

لا يتحمل موقع مجالات – بأي حال من الأحوال – أي مسؤولية تجاه أي مستخدم عن أي أضرار أو خسائر تنشأ عن أو تتعلق بـ:

استخدام أو إساءة استخدام أو عدم القدرة على استخدام الموقع.

استخدام أو الاعتماد على أي محتوى مقدم من خلال الموقع.

الكشف عن معلومات الحساب أو كلمة المرور.

أي أخطاء أو إهمال أو عدم دقة في الموقع أو المحتوى أو المعلومات.

أي روابط لمواقع أخرى ترتبط بموقعنا أو يمكن الوصول إليها من خلال أي محتوى أو مواد متوفرة على الموقع.

لا يضمن موقع مجالات بأن المواد أو المحتويات المنشورة على موقعنا ستلبي الاحتياجات أو تحقق التوقعات الخاصة بالمستخدم. كما أننا لا نقدم أي ضمان بشأن دقة واكتمال وتوقيت أو نوعية موقعنا أو أي مواد أو محتويات، أو بشأن استمرار تقديم أي مواد أو محتويات معينة.

لا يتحمل موقع مجالات أي مسئولية أو التزام تجاه أي مستخدم نتيجة أي خسارة ناجمة عن أمور خارجة عن إرادتنا ولا دخل لنا فيها، وهذا يتضمن تعطل المعدات والأجهزة الإلكترونية أو الاتصالات (بما في ذلك جهاز الحاسوب، والهاتف، والإنترنت)، أو الوصول غير المشروع، أو أخطاء التشغيل، أو أي أمور أخرى.

لا يتحمل موقع مجالات أي مسؤولية عن أمان أو سرية أو خصوصية الحساب أو نقل البيانات عبر الإنترنت، ولا نضمن أي خطأ أو فقدان لأي محتوى أو بيانات أو معلومات.

يحتفظ موقع مجالات بالحق في إزالة أي محتوى من الموقع في أي وقت ولأي سبب دون إشعار مسبق في حالة انتهاك هذه الشروط والأحكام. كما يحتفظ بالحق في مساءلة أي مستخدم قانوناً عن استخدام الموقع أو الخدمات لأي أغراض أو انتهاكات غير قانونية أو تشهيرية أو انتحال الهوية أو لأغراض المنافسين، وغيرها من المخالفات الغير مقبولة.

الفيروسات
لا يضمن موقع مجالات بأن الجوانب الوظيفية للموقع أو محتوى المستخدم أو أي معلومات أخرى يتم تقديمها أو نشرها على الموقع أو الخوادم التي يعمل عليها ستعمل دون انقطاع أو تأخير أو حدوث أي أعطال أو ستكون خالية من الأخطاء أو العيوب أو الفيروسات أو المكونات التقنية الأخرى الضارة.

أنت المسئول عن ضبط المعلومات التكنولوجية الخاصة بك، وبرامج وأنظمة الحاسوب من أجل دخول موقعنا، واستخدام برامج الحماية من الفيروسات الخاصة بك.

يُمنع إساءة استخدام موقعنا عمداً بإدخال جميع أنواع الفيروسات بلا استثناء، كما يُمنع محاولة الدخول غير المصرح به إلى الخادم الذي يُخزن عليه موقعنا أو أي خادم آخر أو حاسوب أو قاعدة بيانات تتعلق بموقعنا، وفي حال حدوث مثل هذه الانتهاكات، فسيتم سلب حقك في استخدام موقعنا في الحال واتخاذ كافة الاجراءات القانونية ضدك.

الملكية الفكرية
الموقع والخدمات والمحتويات والمعلومات والمواد الموجودة على الموقع (باستثناء مساهمات ومشاركات المستخدمين) والحقوق المتعلقة بالموقع الإلكتروني والتي تشمل واجهة المستخدم وعناوين الصفحات وتخطيط الصفحة وأيقونات الأزرار والشعارات والتصاميم والنصوص والصور والمقاطع الصوتية والفيديو والرسومات والأشكال والتوضيحات والمواد الرقمية والبيانات والبرامج والتعليمات البرمجية الأساسية والحقوق البرمجية ورمز (HTML) وغيرها من الرموز التي يحتوي عليها الموقع الإلكتروني (يُشار إليها بـ "الملكية الفكرية") هي ملك لـ مجالات والمرخِصين له، وكلها محمية بموجب قوانين الملكية الفكرية الوطنية والدولية. ويتم منحك الحق في استخدام الخدمات فقط وللأغراض الموضحة بواسطة مجالات.

يحتفظ مالكو المحتوى بجميع الحقوق غير الممنوحة صراحةً في هذه الشروط ولا تمنح هذه التراخيص أي تراخيص ضمنية.

إذا قمت بتنزيل أو طباعة نسخة من أي محتوى من موقع مجالات للاستخدام الشخصي، يجب عليك الاحتفاظ بجميع حقوق الطبع والنشر وغيرها من إشعارات وحقوق الملكية الواردة فيه. ولا يجوز لك استخدام أو إعادة إنتاج أو عرض أو تنفيذ أو توزيع مثل هذا المحتوى بأي شكل من الأشكال لأي غرض عام أو تجاري ما لم يتم منح هذا الاستخدام صراحة من قبل ترخيص معين

تعد جميع العلامات التجارية والشعارات والأسماء التجارية ورؤوس الصفحات والرسومات المخصصة وأيقونات الأزرار وأسماء النطاقات هي علامات خدمة أو مظهر تجاري (مجتمعة "العلامات التجارية") هي ملك موقع مجالات أو مرخصيه، لا يجوز لك تغيير أو حذف أي من حقوق التأليف والنشر أو العلامة التجارية أو حقوق الملكية.

روابط لمواقع خارجية
قد يحتوي موقعنا من وقت لآخر، على روابط لمواقع أخرى تابعة لأطراف أخرى وحيث أن هذه المواقع لا تخضع لرقابتنا ولا نتحكم فبها. فإننا لا نتحمل أي مسئولية عن نوعية أي محتوى أو طبيعة أو دقة أي موقع أو رابط آخر يمكن الوصول إليه من خلال أي رابط متاح على موقعنا أو المواقع المتصلة به سواء بطريقة مباشرة أو غير مباشرة. يرجى التوجه لمسؤول الموقع الخارجي مباشرة عند حدوث أي مشكلة بشأن الرابط.

الإخطارات والاتصالات الإلكترونية
عند تقوم بزيارة موقع مجالات أو استخدام الخدمات أو إرسال بريد إلكتروني إلينا، فأنت توافق على التواصل معك إلكترونياً فيما يتعلق بالخدمات أو المسائل الإدارية المتعلقة بها، أو أمن وخصوصية الحساب أو المسائل المتعلقة بتحديثات الشروط والأحكام، وتوافق على أن جميع الاتفاقيات والإشعارات والتعليمات ووسائل الاتصال الأخرى التي نقدمها لك إلكترونياً تفي بأي متطلبات قانونية وتتمتع بالصفة القانونية ذاتها التي هي في وسائل الاتصال المكتوبة.

يتم استخدام عنوان بريدك الإلكتروني لإرسال معلومات حول خدماتنا أو لأغراض تسويقية أو غيرها إلى عنوان البريد الإلكتروني الذي قدمته و/أو سجلته لدينا ما لم تقم بإلغاء الاشتراك في مثل هذه الرسائل الإلكترونية باستخدام رابط إلغاء الاشتراك أسفل رسائل البريد الإلكتروني.

التعويض
أنت توافق على الدفاع عن وحماية موقع مجالات وأي من مسؤوليه ومدراءه وموظفيه أو التابعين له وتعويضهم عن جميع المطالبات أو الالتزامات أو الأضرار أو الخسائر أو المصروفات بما في ذلك الرسوم القانونية وأتعاب المحاماة والتكاليف المعقولة، ذات الصلة أو الناشئة عن:

استخدام أو إساءة استخدام الموقع أو الخدمات المقدمة لك.

نشر أو إرسال المحتوى أو المواد المخالفة لسياساتنا، أو نتيجة الاستخدام غير القانوني للموقع.

انتهاك أي من الشروط والسياسات المتبعة لدينا أو أي قواعد أو إرشادات إضافية منشورة في الموقع.

أي تزييف يأتي من جانبك في أي معلومات أو وسائل تواصل أو انتحال شخصية الغير.

انتهاك القوانين المطبقة أو انتهاك الحقوق بما في ذلك حقوق الملكية الفكرية.

التغييرات في الشروط والخدمات
يحق لموقع مجالات تعديل أو تحديث أو تغيير هذه الشروط أو الخدمات وفقاً لتقديره الخاص وفي أي وقت وفقاً لما يراه مناسباً، ويعتبر أي تعديل على هذه الشروط ساري المفعول فور نشره على الموقع الإلكتروني، ويُعد استخدامك لموقعنا الإلكتروني بعد إجراء تلك التغييرات موافقة صريحة على الالتزام بالشروط المُعدّلة. لذا نرجو منك قراءة ومراجعة هذه الشروط بشكل دوري للتأكد من جميع البنود والشروط السائدة لاستخدام الموقع. إذا لم تكن موافقاً على أي تغيير يطرأ على هذه الشروط، فيجب عليك عندها التوقف عن استخدام موقعنا.

الطبيعة القانونية للشروط والأحكام
تعد هذه الشروط والأحكام عقداً صحيحاً مكتملاً الأركان القانونية نافذاً في مواجهة جميع الأطراف المذكورة، وتكون أحكامه والتزاماته ملزمة لهم جميعاً، ولا يجوز لأحد التحلل منها أو إنهائها طالما أنتجت آثارها القانونية.

تُطبق إدارة مجالات نفس الشروط والأحكام في حال تم تقديم خدمات الموقع عن طريق تطبيق إلكتروني يعمل على الأجهزة الذكية عبر متاجر أبل وأندرويد.

المدة والإنهاء
تظل هذه الاتفاقية سارية المفعول والتأثير الكامل أثناء استخدامك لموقع مجالات والخدمات وما لم يتم إنهاء حسابك أو استخدامك.

يحق لموقع مجالات وفقاً لتقديره الخاص، لأي سبب أو بدون سبب بإشعار أو بدون إشعار وبدون أي مسؤولية أو التزام، بتعليق أو إنهاء أي حساب (أو أي جزء منه)، كما يحق لموقع مجالات وفقاً لتقديره الخاص وفي أي وقت بالتوقف عن توفير الوصول إلى الخدمات، أو تقييد وصول أي مستخدم إلى كل/أو أي جزء من الموقع أو الخدمات، ولن يتحمل أي مسؤولية أو التزام تجاه أي مستخدم إذا قرر القيام بذلك.

يمكنك إنهاء هذه الاتفاقية في أي وقت عن طريق التوقف عن استخدام الخدمات، وبالتالي عند الإنهاء ستتوقف الحقوق و/أو التراخيص الممنوحة لك في هذه الشروط ما لم يتم إخطارك بخلاف ذلك.

تطبيق القوانين
تخضع وتفسر هذه الشروط والأحكام وسياسة الخصوصية وأي تعديلات عليها وفقاً للقوانين الدولية وتخضع كافة النزاعات أو المطالبات أو الخلافات الناشئة عنها أو تتعلق بها أو باستخدام الموقع أو الخدمات إلى سلطة الاختصاص الحصري للمحاكم الدولية.

إذا تم اعتبار أي بند من بنود هذه الشروط غير قانوني أو غير قابل للتنفيذ لأي سبب، فسيُعتبر هذا البند قابلاً للفصل من هذه الشروط ولن يؤثر على صلاحية وإمكانية تنفيذ أي من البنود المتبقية.

أحكام ختامية
الاتفاق الكامل: تشكل هذه الشروط والأحكام وجميع التعديلات عليها الاتفاق الكامل والنهائي بين موقع مجالات من ناحية، وأي شخص يزور أو يستخدم أياً من خصائص أو ميزات أو خدمات الموقع من ناحية أخرى.

القوة القاهرة: لا يتحمل موقع مجالات أي مسئولية عن التقصير أو الاخفاق أو التأخر في الأداء متى كان ذلك ناجماً عن ظروف خارجة عن السيطرة أو الإرادة، أو بسبب القوة القاهرة أو الظروف الطارئة التي قد تؤدي إلى تعليق أو تعطيل عمل الموقع أو الخدمات بصورة تلقائية.

حظر التنازل: لا يجوز لك التنازل عن التزاماتك وحقوقك بموجب هذه الشروط، أو أن تعهد بإدارة حسابك إلى طرف آخر إلا بعد الحصول على موافقة خطية منا، ولن يشكل إخفاقنا أو تأخيرنا في تنفيذ أي من هذه الشروط تنازلاً عن حقوقنا ضدك ولا يؤثر على حقنا في المطالبة بأدائها في المستقبل.

اللغة: تم صياغة هذه الشروط والأحكام باللغة العربية وفي حال ترجمتها إلى أي لغة أجنبية أخرى، فإن اللغة العربية تكون المعتمدة والسارية أمام جميع الهيئات الرسمية وغير الرسمية إذا تعارضت معها اللغة الأجنبية.

تعارض الشروط: في حال تعارضت هذه الشروط مع أي من الاصدارات السابقة لها، فإن النسخة الحالية تسود ما لم ينص فيها على خلاف ذلك.

جميع الحقوق محفوظة ©''';
}
