// ignore_for_file: prefer_const_constructors

import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:flutter_markdown/flutter_markdown.dart';
import '../widgets/popup_menu_widget.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    String privacyPolicy = '''
# سياسة الخصوصية
تاريخ السريان: يناير 2021

# المقدمة
نحترم حقوق الخصوصية لزوارنا ومستخدمينا ونقر بأهمية حماية المعلومات الشخصية التي تم جمعها عنهم، لذا نوصيكم بقراءة بنود هذه السياسة بعناية تامة والتي تتعلق بخصوصية معلوماتكم، والتي توضح كيف يقوم موقع (https://majalaat.com) يُشار إليه فيما بعد باسم ("مجالات" أو "الموقع" أو "المنصة) بجمع واستخدام ومشاركة المعلومات الشخصية وغيرها من الإجراءات المتعلقة بمعلوماتكم. من خلال الوصول إلى أو استخدام خدمات مجالات، فأنت توافق صراحةً على الالتزام ببنود وأحكام هذه السياسة الموضحة أدناه، والتي تعد جزءً من شروط وأحكام مجالات، إذا كنت لا توافق على الالتزام ببنود هذه السياسة، يرجى عدم استخدام موقعنا.

## نطاق الخصوصية
تنطبق هذه السياسة على المعلومات الشخصية التي تقدمها أو يتم جمعها من خلال خدمات منصة مجالات وهي تشمل جميع المحتوى والصفحات الموجودة ضمن الموقع الإلكتروني، ولا تنطبق على أي مواقع أو روابط خارجية أو أي معلومات نحصل عليها منك بطرق أخرى، ولا نتحمل أية مسؤولية عن أي معلومات شخصية قد تقدمها إلى هذه الأطراف الخارجية من خلال الموقع.

## جمع المعلومات
نحن وشركاؤنا في الخدمة نقوم بجمع أنواعٍ مختلفة من المعلومات المرتبطة بخدمات مجالات، بما في ذلك المعلومات الشخصية التي تقدمها لنا مباشرة في حال تسجيل حساب أو استخدامك للخدمات، وتشمل عملية جمع المعلومات ما يلي:

معلومات الانضمام والتسجيل: قد نجمع بعض المعلومات الشخصية منك عندما تقدم طلب الانضمام أو التسجيل للموقع، قد تتضمّن هذه المعلومات بيانات شخصيّة مثل (الاسم الشخصي، واسم العائلة، والبريد الإلكتروني، ورقم الهاتف، والبلد) على سبيل المثال لا الحصر.

المعلومات التقنية: موقع مجالات مثل العديد من المواقع الأخرى على شبكة الإنترنت يقوم بجمع معلومات عن زوار الموقع من خلال أي جهاز؛ حيث يقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك أو الجهاز الذي تستخدمه من قبل موفر خدمة الإنترنت (ISP)، ونوع متصفح الإنترنت الذي تستخدمه، وإصدار المتصفح، ومزود خدمة الإنترنت، وبلد الزائر، وعنوان (URL) وصفحات الإحالة إلى موقعنا، وصفحات خدماتنا التي تزورها، وتاريخ ووقت الزيارة، وعدد النقرات، وغيرها من المعلومات التي يتم تجميعها واستخدامها لتسيير وإدارة الموقع ومعرفة توجهات الزائرين، ولأغراض تحليل وتحسين الجودة، وجميع هذه المعلومات تحفظ في سرية تامة من قبلنا، وتبقى ضمن نطاق التطوير والتحسين الخاص بموقعنا فقط.

معلومات خارج نطاق الانترنت: قد نجمع المعلومات الشخصية بطريقة خارجه عن نطاق الانترنت، فمثلاً عند التواصل مع أحد المستخدمين يمكن أن يتم توجيهك إلى رابط رقم واتساب الخاص بهم.

معلومات الاستخدام والتفاعل: موقع مجالات مثل العديد من المواقع الأخرى على شبكة الإنترنت يقوم بجمع معلومات حول الاستخدام والتفاعل خلال استخدام الموقع.

ملفات تعريف الارتباط (الكوكيز): تتيح ملفات تعريف الارتباط لخادم الويب نقل البيانات إلى حاسوب أو جهاز لغرض حفظها ولأغراض أخرى. إذا كنت لا ترغب في جمع المعلومات من خلال استخدام ملفات تعريف الارتباط، فيمكنك إيقاف أو تعطيل استخدام ملفات تعريف الارتباط. للمزيد من المعلومات حول استخدامنا لملفات تعريف الارتباط، نرجو منك مراجعة سياسة ملفات تعريف الارتباط الخاصة بنا.

معلومات التواصل: قد نقوم بجمع معلوماتك الشخصية عندما تتواصل معنا بشأن أي استفسار أثناء استخدامك للموقع أو لخدماتنا أو التواصل أو الاتصال بنا، وتشمل هذه المعلومات بيانات مثل الاسم، ورقم الهاتف، والبريد الإلكتروني، وتفاصيل الطلب.

المعلومات الأخرى التي تزودنا بها: قد تقدم لنا طوعاً معلومات إضافية عن نفسك، بما في ذلك، على سبيل المثال لا الحصر: الاسم، العنوان، الجنس، البلد، وتفضيلات الخدمة، ونوع الهاتف الذكي ومعلومات تقنية عن أساليب اتصال المستخدم بالموقع الإلكتروني، وغيرها من المعلومات المشابهة التي زودتنا بها من خلال ملء النماذج المتوفّرة على موقع مجالات أو من خلال التواصل معنا عبر الهاتف، أو البريد الإلكتروني، أو أيّ وسيلة أخرى.

## استخدام المعلومات
يستخدم موقع مجالات المعلومات للأغراض التالية:

لإنشاء الحسابات والتواصل معك بشأن الخدمات.

لإدارة الموقع ومراقبة استخدامه والكشف عن المشكلات الفنية ومنعها ومعالجتها.

لتوفير وتخصيص وتحسين تجربتك مع خدماتنا وتطوير خدمات جديدة.

لتحسين وتعزيز سلامة وأمن خدماتنا، ومنع استخدام خدماتنا بأي طرق غير قانونية أو احتيالية.

لإتاحة فرصة التواصل معنا أو التواصل مع المستخدمين الآخرين.

لتقديم خدمات الدعم الفني والرد على استفساراتك وأسئلتك وتعليقاتك وتلبية طلباتك.

لأغراض التسويق والترويج والبحث والأغراض الإحصائية وأبحاث السوق والدراسات الاستقصائية.

لقياس أو فهم الأداء مثل فعالية الإعلانات التي نقدمها لك ولغيرك، وتقديم الإعلانات ذات الصلة بك.

لأغراض أعمالنا، مثل تحليل البيانات، وتحسين المحتوى، وتشغيل وتوسيع أنشطة أعمالنا.

لإعلامك بالمعلومات الإدارية مثل معلومات عن الموقع الالكتروني أو التغييرات في الشروط والأحكام.

## مشاركة المعلومات
يحتفظ موقع مجالات في كافة الأوقات بسرية وخصوصية بياناتكم الشخصية التي يحصل عليها، حيث تعتبر بياناتك ومعلوماتك الشخصية جزءً مهماً من أعمالنا، ولكن يجوز لنا مشاركة المعلومات مع أطراف أخرى يقدمون خدمات أو وظائف نيابة عنا، بما في ذلك تحليلات الأعمال، وخدمة العملاء، والتسويق، والعلاقات العامة، وتوزيع الاستطلاعات، ومنع الاحتيال. قد نأذن أيضاً لمورّدي الجهات الخارجية بتجميع المعلومات نيابةً عنا، بما في ذلك، على سبيل المثال، عند الضرورة لتشغيل ميزات في الموقع، أو لتسهيل تقديم الإعلانات عبر الإنترنت المصممة خصيصاً لك، حيث يمتلك موردو الجهات الخارجية حق الوصول إلى المعلومات ويجوز لهم جمعها فقط عند الحاجة لأداء وظائفهم.

يجوز لنا مشاركة معلوماتك -حسب الضرورة -للأغراض التالية:

للامتثال للإجراءات القانونية أو للامتثال لأوامر الاستدعاء الشرعية أو القابلة للتنفيذ أو أوامر المحكمة.

للاستجابة للطلبات المقدمة من السلطات العامة والحكومية وسلطات تنفيذ القانون وحماية البيانات.

لحماية حقوقنا وخصوصيتنا وسلامتنا وممتلكاتنا و/أو حقوقك أو الآخرين.

يجوز لنا أيضاً مشاركة معلوماتك الشخصية للأغراض الاعلانية والتسويقية من خلال جهات خارجية، يرجى العلم أننا لا نتحكم في السياسات والممارسات المتبعة لدى هذه الجهات الخارجية، ويجب عليك مراجعتها للاطلاع على ممارساتهم الخاصة.

## الاحتفاظ بالمعلومات
نحتفظ بمعلومات المستخدمين الشخصية طالما كان ذلك ضرورياً وللأغراض المحددة في هذه السياسة، ويكون استخدامها بالقدر اللازم للامتثال لالتزاماتنا القانونية وحل النزاعات، وإنفاذ اتفاقياتنا وسياساتنا القانونية، ونحتفظ أيضاً ببعض معلوماتك الشخصية المرتبطة بالحسابات في أرشيفاتنا عندما تظل تستخدم خدماتنا، بما في ذلك لأغراض التحليل الداخلي، أو لتعزيز الأمان أو لتحسين وظائف خدماتنا. تعتمد الفترات التي نحتفظ فيها بمعلوماتك على الغرض الذي جمعناه من أجله ونستخدمه.

## أمان وحماية البيانات
يعد أمان بياناتك أمراً مهماً بالنسبة لنا، لذا نحن نسعى لحماية والحفاظ على جميع المعلومات الشخصية للمستخدمين التي تحت سيطرتنا وعدم الإفصاح عليها بما يخالف السياسة المعمول بها في موقع مجالات.

نحن نتخذ كافة التدابير الأمنية اللازمة والمناسبة لحماية المعلومات الشخصية التي تحت سيطرتنا من الفقد أو التلف أو التغيير أو الإفشاء أو الوصول غير المصرح به أو الاستخدام غير المقصود وغير القانوني. ومع ذلك، من الممكن ألا يكون هذا المستوى من الحماية فعال بنسبة 100% إلا إذا كنت تتبع سياسات أمنية خاصة بك.

إذا كنت تشعر بالقلق بأن تعاملك معنا ليس آمن، يرجى التواصل معنا وإخطارنا بذلك.

## الإفصاح عن المعلومات
نحن لا نبيع أو نتاجر أو ننقل معلوماتك الشخصية إلى أي أطراف خارجية ولا يشمل ذلك الجهات الخارجية الموثوقة التي تساعدنا في تشغيل الموقع، أو إجراء أعمالنا، أو خدمتك، طالما أن هذه الأطراف توافق على الحفاظ على سرية هذه المعلومات.

في حالة حدوث أي انتقال أو تغيير في أعمالنا كالاندماج أو الاستحواذ من قبل شركة أخرى، أو بيع كل أو جزء من الأصول، فإن حسابات وبيانات المستخدمين ستكون جزءً من هذه العملية.

## مسئولية تقديم البيانات
أنت تقر بأنك تقدم معلوماتك وبياناتك على مسئوليتك الشخصية، وفي حالة قيامك بتزويدنا بأي بيانات خاصة بالغير بشكل كاذب أو احتيالي فإنك تتحمل المسئولية القانونية في مواجهتنا وأمام الجهات المختصة وفي مواجهة المتضرر من تزويدنا بتلك البيانات مع التزامك بدفع كافة التعويضات المناسبة.

أنت تعلم وتوافق على أن الموقع يتحكم في البيانات التي يسيطر عليها بنفسه، وبالتالي لا نملك السيطرة على أي بيانات قدمتها لطرف آخر.

## المواد التسويقية
قد نرسل إليك مواداً تسويقية بشأن الخدمات التي نقدمها والتي قد تهمك، بالإضافة إلى معلومات أخرى في شكل إشعارات ونشرات إخبارية وعروض أو مزايا أخرى نعتقد أنها مهمة بالنسبة لك، وإذا كنت ترغب في أي وقت في عدم تلقي أي مواد تسويقية منا، يمكنك إلغاء الاشتراك في الاتصالات التسويقية التي تلقيتها أو إخطارنا من خلال قسم "تواصل معنا". وتوضيح رغبتك في عدم استلام أي مواد تسويقية منا.

الرسائل الالكترونية
قد يرسل موقع مجالات رسائل إلكترونية تتعلق بالموقع والخدمات إلى البريد المسجل لدينا، إذا كنت لا ترغب في استلام مثل هذه الرسائل الإلكترونية، فيمكنك النقر على رابط إلغاء الاشتراك في الجزء الأسفل من البريد الإلكتروني المرسل من قبلنا لإلغاء وتعطيل اتصالات البريد الإلكتروني التسويقي.

## روابط لأطراف أخرى
قد يحتوي موقعنا على روابط خارجية أو إعلانات لمواقع تابعة لأطراف أخرى لا نملكها وليست تحت إدارتنا، إذا قمت بالنقر على تلك الروابط سيتم إحالتك إلى هذه المواقع الخارجية التي أنشئت تلك الروابط في موقعنا، فقد يقوم مشغلو تلك المواقع بجمع معلومات عنك واستخدامها من قبلهم وفقاً لسياسة الخصوصية المعمول بها لديهم، والتي قد تختلف عن سياستنا. لذلك نحن لا نتدخل في إعداد هذه السياسات ولا نقدم أي اعتماد بشأنها، ونأمل منكم الاطلاع على وقراءة سياسة الخصوصية المعتمدة على مواقع الروابط الخارجية قبل استخدام موقعنا.

## تغييرات سياسة الخصوصية
يحتفظ موقع مجالات بالحق في إجراء أي تعديلات أو تغييرات على هذه السياسة إن لزم الأمر ومتى كان ذلك ملائماً من وقت لآخر وفقاً لتقديره الخاص؛ لمواكبة المتطلبات القانونية والطريقة التي يدير بها أعماله. وستنفذ هذه السياسة بمجرد نشرها على الموقع. ومن خلال الاستمرار في استخدام موقعنا بعد إجراء هذه التعديلات، فإنك تقبل وتوافق على التعديلات والالتزام بها، يُرجى مراجعة هذه السياسة بشكل منتظم للاطلاع على النسخة الأحدث من سياسة الخصوصية هذه.

تسري جميع التعديلات والتغييرات على سياسة الخصوصية فور نشرها، واستخدامك لخدماتنا بعد تعديل أو تغيير أي من هذه المواد أو نشر النسخة المُحدّثة يعني موافقتك على جميع هذه التعديلات.

## سياسة ملفات تعريف الارتباط
تعتبر ملفات تعريف الارتباط ضرورية للغاية لكي يعمل موقعنا الإلكتروني وتستخدم لمساعدتنا على فهم كيفية تفاعلك مع موقعنا حتى نتمكن من تحسينه وتشغيل خدماتنا وتزويدك بتجربة أفضل، وفي حالة ما قررت تعطيل هذه الملفات فقد لا يمكنك الوصول إلى أجزاء من موقعنا الإلكتروني، أو الوصول إلى منطقة الآمنة الخاصة بنا.

## ما هي ملفات تعريف الارتباط؟
هي عبارة عن ملفات نصية صغيرة غالباً ما تتضمن معرفاً فريداً يتم نقلها عبر الموقع الإلكتروني إلى القرص الصلب في جهازك الكمبيوتر أو الهاتف المحمول أو الجهاز اللوحي بواسطة خادم الويب، بحيث يمكن للموقع أن يتذكر بعض المعلومات حول نشاط تصفحك أو هويتك في كل مرة تزور فيها الموقع. وستقوم ملفات الكوكيز بجمع المعلومات المتعلقة باستخدامك لخدماتنا، وتساعدنا في تكييف خدماتنا مع اهتماماتك. كما أنها تساعدنا على تحليل استخدامك لخدماتنا ومساعدتنا على توفير تجربة أفضل لك.

ما الغرض من استخدام معلومات ملفات تعريف الارتباط؟
إن الغرض من استخدام معلومات ملفات تعريف الارتباط الآتي:

التعرف على جهاز ك عند زيارة الموقع، وتتبعك عند تصفح الموقع.

مراقبة وتحليل كلاً من أداء إعلاناتنا وتشغيلها ومدى تأثيرها.

تمكين المستخدمين من الاطلاع على المحتوى والإعلانات التي يتم تخصيصهما وفقاً لاحتياجاتهم.

لتحسين وإدارة وتحليل استخدام الموقع.

للاحتياجات الأمنية ولأغراض الحماية من الاحتيال.

## ما هي أنواع ملفات الارتباط التي نستخدمها؟

ملفات تعريف الارتباط للجلسة: تستخدم هذه الملفات لتشغيل موقعنا الإلكتروني، وللتعرّف على المخاطر الأمنية ومنعها. على سبيل المثال، ملفات تعريف الارتباط التي تمكنكم من تسجيل الدخول إلى المناطق الآمنة من موقعنا، وملفات تعريف الارتباط هذه لتخزين معلومات جلستك لمنع آخرين من تغيير كلمة المرور الخاصة بك بدون اسم المستخدم وكلمة المرور.

ملفات تعريف الارتباط المفضلة: نستخدم ملفات تعريف الارتباط هذه لتذكّر إعداداتك وتفضيلاتك، وللارتقاء بتجربتك على موقعنا. على سبيل المثال، قد نستخدم هذه الملفات لتذكّر تفضيلاتك.

ملفات تعريف الارتباط الأمنية وأغراض الأداء: نستخدم ملفات تعريف الارتباط هذه لجمع المعلومات عن كيفية استخدامك لموقعنا ومراقبة أداء الموقع وتحسين أداء الموقع وخدماتنا وتجاربنا. على سبيل المثال، يُمكننا استخدام هذه الملفات للتعرف على وحساب عدد الزوار ومعرفة المزيد عن المزايا الأكثر شيوعاً واستخداماً لدى مستخدمينا والمزايا التي ربما تحتاج إلى بعض التعديلات.

ملفات تعريف الارتباط الإعلانية وأغراض الاستهداف: نستخدم ملفات تعريف الارتباط هذه لتقديم الإعلانات، وتتبع كفاءة حملاتنا الإعلانية لكُلٍ من خدماتنا وموقعنا الإلكتروني. يُمكننا استخدام هذه الملفات لتسجيل زيارتك على الموقع والصفحات التي قمت بتصفحها والروابط التي قمت باتباعها. يجوز لنا إطلاع شركاؤنا الإعلانيون من الأطراف الثالثة على هذه المعلومات وتقديم الإعلانات ذات الصلة على مواقع أخرى.

## ملفات تعريف ارتباط الطرف الثالث

قد يتم وضع ملفات تعريف الارتباط الخاصة بمواقع خارجية بواسطة خدمات تظهر على هذه المواقع الخارجية. لا يملك مجالات أي سيطرة على هذه الملفات. قد تكون على سبيل المثال، ملفات تعريف الارتباط التي تضعها مواقع التواصل الاجتماعي، لمزيد من المعلومات حول ملفات تعريف الارتباط للجهات الخارجية، نقترح عليك زيارة مواقع الجهات الخارجية.

## التواصل معنا
إذا كان لديك أي أسئلة أو استفسارات حول سياسة الخصوصية أو سياسة ملفات تعريف الارتباط، يمكنك التواصل معنا عبر:

▪ البريد الإلكتروني: majalaat@gmail.com

أنت تٌقر بقراءة بنود هذه السياسة والموافقة على الالتزام بجميع بنودها وشروطها.

جميع الحقوق محفوظة © منصة مجالات 2021''';
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
          appBar: AppBar(
            title: Row(
              mainAxisAlignment: MainAxisAlignment.spaceBetween,
              children: [
                Text('عن مجالات', style: GoogleFonts.almarai()),
                PopUpMenuWidget(
                  currentPage: "about",
                )
              ],
            ),
          ),
          body: SafeArea(
              child: SingleChildScrollView(
                  child: Container(
            padding: EdgeInsets.symmetric(vertical: 40, horizontal: 20),
            child: MarkdownBody(
              data: privacyPolicy,
            ),
          )))),
    );
  }
}
